# Module1. Pandas and Numpy
Pandas and numpy are the two most commonly used package for doing data analysis in Python. Pandas provides comprehensive tools for the user to manipulate the structured data, and Numpy is a package designed to handle the vector and matrix operation. Both are powerful and useful.
In this module, we will focus more on Pandas, and try to use it to: 1.explore the data, 2.merge the data, and 3.clean and transform the data.

In [1]:
# import the package
import pandas as pd
import numpy as np

## 1.Use Pandas for Exploratory Data Analysis
Pandas is just like Excel, it is designed to handle structured data. You can use pandas to quickly produce some statistics for the data.
This process is sometimes called exploratorry data analysis(EDA). EDA is a basic but important step for doing data analysis.

### Read the data: read_csv() and read_excel()
You can use read_csv("xxx.csv") or read_excel("xxx.xlsx") to read .csv or excel file

In [2]:
# read the data
# if you are working on Google Colab, please change the path to :
# https://raw.githubusercontent.com/JumpingSquid/py_tutorial/master/titanic.csv
df = pd.read_csv("titanic.csv")

### Take a look: head() and describe()

In [3]:
# have a look at the data
# use "head" to display the top n data
df.head(n=10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [4]:
# we can also use "describe" to show the simple stat
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Index and slice - part I: loc and iloc
loc and iloc are the two major ways to get the data from the dataframe. loc takes the name or boolean mask as input, iloc take the number index (e.g. the third row with fifth column).

Note: ":" means all rows or columns.
<br>You can also set the starting point or the end point, like 
<br><b>\[2:\]</b> means from 2 to the last number
<br><b>\[:3\]</b> means for the first to the second (not third!), and 
<br><b>\[2:4\]</b> means the second and the third.
<br>You can also use negative number, like <b>\[:-1\]</b> means from the first to the last two.

In [32]:
# loc use index and column name
# loc[row index, column name]
df.loc[:, "Age"] #

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [6]:
# extract the data by row index
df.loc[0, :]

PassengerId                          1
Survived                             0
Pclass                               3
Name           Braund, Mr. Owen Harris
Sex                               male
Age                                 22
SibSp                                1
Parch                                0
Ticket                       A/5 21171
Fare                              7.25
Cabin                              NaN
Embarked                             S
Name: 0, dtype: object

In [7]:
# of course you can extract multiple index or columns by using list
df.loc[[0,1,2], ["Name", "Sex", "Age"]]

                                                Name     Sex   Age
0                            Braund, Mr. Owen Harris    male  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                             Heikkinen, Miss. Laina  female  26.0

In [8]:
# iloc use the coordinate
df.iloc[:, 3]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [9]:
# iloc use the coordinate
df.iloc[1, :]

PassengerId                                                    2
Survived                                                       1
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                           38
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [10]:
# again, you can use list to contain all the rows and columns' index
df.iloc[[1,2,3], [1,2,3]]

   Survived  Pclass                                               Name
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina
3         1       1       Futrelle, Mrs. Jacques Heath (Lily May Peel)

In [11]:
# you can also use this way to extract the entire column
df.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

### Index and slice - part II: conditional select
When we try to find specific columns or rows, we generally do not find iy by id but by some conditions (like SELECT and WHERE in SQL).<br>
loc\[\] allows you to do that by specify the condition for the row or column in a form like:<br>
<b>loc\[condition for rows, condition for columns\]</b>

In [12]:
df.loc[df.Age < 10, ["Name", "Sex", "Age"]]

                                         Name     Sex   Age
7              Palsson, Master. Gosta Leonard    male  2.00
10            Sandstrom, Miss. Marguerite Rut  female  4.00
16                       Rice, Master. Eugene    male  2.00
24              Palsson, Miss. Torborg Danira  female  8.00
43   Laroche, Miss. Simonne Marie Anne Andree  female  3.00
..                                        ...     ...   ...
827                     Mallet, Master. Andre    male  1.00
831           Richards, Master. George Sibley    male  0.83
850   Andersson, Master. Sigvard Harald Elias    male  4.00
852                   Boulos, Miss. Nourelain  female  9.00
869           Johnson, Master. Harold Theodor    male  4.00

[62 rows x 3 columns]

In [31]:
df.loc[:, df.columns == "Age"]

      Age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888   NaN
889  26.0
890  32.0

[891 rows x 1 columns]

### Other ueful tools for EDA: value_counts(), groupby(), and pivot_table()

In [13]:
# count the number
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [14]:
# grouped by
df.groupby(by="Sex").mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [15]:
# pivot table
df.pivot_table(index="Sex", columns="Pclass", aggfunc="size")

Pclass    1    2    3
Sex
female   94   76  144
male    122  108  347

## Excercise One:
Can you extract the dataframe conditional on people who stay in the third class and are female passenger?

## 2. Use Pandas to combine the data
In practice, it is rare to have a complete, clean, and merged data. You typically need to combine several relational dataset into one. Pandas has many tools to help you achieve this. Now let's try some of them.

In [16]:
# To learn this, we split the data into two pieces
# Ignore this block, as this is not important at all
df_personal = df.loc[:, ["Name", "Sex", "Age"]].sample(frac=1).reset_index(drop=True)
df_ticket = df.loc[:, ['PassengerId', 'Pclass', 'Name', 'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked']].sample(frac=1).reset_index(drop=True)
df_survival = df.loc[:, ['PassengerId', 'Survived']].sample(frac=1).reset_index(drop=True)

In [17]:
df_personal.head()

                                               Name     Sex   Age
0                               McEvoy, Mr. Michael    male   NaN
1                         Harper, Mr. Henry Sleeper    male  48.0
2                     Sawyer, Mr. Frederick Charles    male  24.5
3  Warren, Mrs. Frank Manley (Anna Sophia Atkinson)  female  60.0
4         Brown, Mrs. James Joseph (Margaret Tobin)  female  44.0

In [18]:
df_ticket.head()

,PassengerId,Pclass,Name,Parch,Ticket,Fare,Cabin,Embarked
0,511,3,"Daly, Mr. Eugene Patrick",0,382651,7.750,NaN,Q
1,775,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",3,29105,23.000,NaN,S
2,462,3,"Morley, Mr. William",0,364506,8.050,NaN,S
3,816,1,"Fry, Mr. Richard",0,112058,0.000,B102,S
4,443,3,"Petterson, Mr. Johan Emil",0,347076,7.775,NaN,S

In [19]:
df_survival.head()

   PassengerId  Survived
0          633         1
1          251         0
2          158         0
3          489         0
4           26         1

### merge() and concat()
When you have multiple data, and you want to bundle them, you can use merge(). merge() basically combine the two data based on the "key".
The key is usually an ID or name. Using merger(), you can choose different way to merge the data. For instance, you can decide whether to keep only the IDs that exist in both data or to keep all the IDs.

In [20]:
pd.merge(df_ticket, df_survival, on='PassengerId', how='outer', indicator=True)

,PassengerId,Pclass,Name,Parch,Ticket,Fare,Cabin,Embarked,Survived,_merge
0,511,3,"Daly, Mr. Eugene Patrick",0,382651,7.7500,NaN,Q,1,both
1,775,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",3,29105,23.0000,NaN,S,1,both
2,462,3,"Morley, Mr. William",0,364506,8.0500,NaN,S,0,both
3,816,1,"Fry, Mr. Richard",0,112058,0.0000,B102,S,0,both
4,443,3,"Petterson, Mr. Johan Emil",0,347076,7.7750,NaN,S,0,both
...,...,...,...,...,...,...,...,...,...,...
886,68,3,"Crease, Mr. Ernest James",0,S.P. 3464,8.1583,NaN,S,0,both
887,299,1,"Saalfeld, Mr. Adolphe",0,19988,30.5000,C106,S,1,both
888,151,2,"Bateman, Rev. Robert James",0,S.O.P. 1166,12.5250,NaN,S,0,both
889,603,1,"Harrington, Mr. Charles H",0,113796,42.4000,NaN,S,0,both
890,780,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",1,24160,211.3375,B3,S,1,both

Besides the case the several data share one id, sometimes you will face the scenario that there are many dataframe with same structure but collected in different timing. To analyze the whole data, you need to use "concatenate".

In [21]:
df_old = df.iloc[:400, :]
df_new = df.iloc[400:, :]

In [22]:
df_old.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
df_new.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
400,401,1,3,"Niskanen, Mr. Juha",male,39.0,0,0,STON/O 2. 3101289,7.9250,NaN,S
401,402,0,3,"Adams, Mr. John",male,26.0,0,0,341826,8.0500,NaN,S
402,403,0,3,"Jussila, Miss. Mari Aina",female,21.0,1,0,4137,9.8250,NaN,S
403,404,0,3,"Hakkarainen, Mr. Pekka Pietari",male,28.0,1,0,STON/O2. 3101279,15.8500,NaN,S
404,405,0,3,"Oreskovic, Miss. Marija",female,20.0,0,0,315096,8.6625,NaN,S

In [24]:
pd.concat([df_old, df_new])

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

## Excersise Two:
Please combine the three dataframe(<b>df_personal, df_survival, df_ticket</b>) into the original one.

## 3. Use Pandas and Numpy to clean and transform the data
Data is not always clean. In fact, the most of your time as a data analyst will be spending on cleaning the data.

### Remove nan: fillna() and dropna()

We can use isnull() to find the columns which have nan value. nan value exists when the original data has no value. It is very important to find the nan when you are doing data analysis.

In [25]:
df.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

Solution 1: fillna() can fill all nan cell with a specific value

In [26]:
df_nona = df.fillna(0)
df_nona.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

Solution 2: dropna() will drop the columns or the rows that contain nan value. It is faster but please be more cautious to use.

In [27]:
df_nona = df.dropna()
df_nona.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age            False
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin          False
Embarked       False
dtype: bool

### Transform the column: using loc(), iloc(), and numpy
If we want to change the value of a column, we need to use loc or iloc to specify the column.

In [28]:
df.Fare

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
886    13.0000
887    30.0000
888    23.4500
889    30.0000
890     7.7500
Name: Fare, Length: 891, dtype: float64

In [29]:
df.loc[:, "Fare"] = df.loc[:, "Fare"] * 30
print(df.Fare)

0       217.500
1      2138.499
2       237.750
3      1593.000
4       241.500
         ...
886     390.000
887     900.000
888     703.500
889     900.000
890     232.500
Name: Fare, Length: 891, dtype: float64

In [30]:
df.loc[:, "Fare"] = np.mean(df.Fare)
print(df.Fare)

0      966.126239
1      966.126239
2      966.126239
3      966.126239
4      966.126239
          ...
886    966.126239
887    966.126239
888    966.126239
889    966.126239
890    966.126239
Name: Fare, Length: 891, dtype: float64

## Excercise Three:
Please fill the nan value in <b>Age</b> column with the mean of other passengers' age.